Revit 2027 API
BaseImportOptions.GetDefaultLengthUnit Method
 Get the default length unit used for importing unitless files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetDefaultLengthUnit()
Public Function GetDefaultLengthUnit As ForgeTypeId
public:
ForgeTypeId^ GetDefaultLengthUnit()
member GetDefaultLengthUnit : unit -> ForgeTypeId
Return Value
ForgeTypeId
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace